// в этом проекте используем модульный подход.
// Это важный аспект любого приложения с устойчивой архитектурой
// Модули позволяют нам:
    // разделять код
    // поддерживать блоки кода в проекте чистыми, разделенными и организованными
    // инкапсулировать данные, давая им приватность
    // объявлять одни данные (и методы) публичными, оставляя другие приавтными и защищенными
//

// Паттерн MVC Model-View-Controller

// M - Модуль с данными - model (все данные приложения, структура данных)
    // 3. Добавление новой записи в структуру данных
    // 5. Подсчет бюджета

// V - UI модуль - view (внешний вид, шаблоны)
    // 2. Получение значений из формы
    // 4. Добавление новой записи на страницу
    // 6. Обновление страницы

// C - Модуль контроллер - controller (прослушка и запуск действий)
    // 1. прослушка события


